{   
        "header-h2": "Développeur Web Front-End",
        "nav-about": "À propos",
        "nav-project": "Projets",
        "theme-dark": "Sombre",
        "theme-light": "Clair",
        "homeAbout": "Né en 2000\nà Caen, France.\nDe pâtissier à développeur.\nAprès 7 ans de métiers\nque je n'aimais pas\net de multiples réflexions.\nJ'ai décidé d'apprendre\nle développement web.\nÀ partir de là,\nje me suis inscrit à une\nformation de développeur\nFront-End sur\nOpen Classrooms\nd'une durée de 9 mois.",
        "aboutText": "Salut, je suis Erwan, un Développeur Web.\n Depuis l'enfance, je passe la plupart de mon temps devant un écran, j'aime aussi apprendre, créer et concevoir.\n J'ai travaillé comme apprenti pâtissier de 2016 à 2018 à la Boulangerie Cherie à Potigny  et j'ai obtenu un diplôme dans ce domaine mais j'ai immédiatement arrêté car  je n'étais pas assez passionné pour continuer à travailler dans ce secteur.\n Après ça, en 2019, j'ai travaillé environ 2 mois comme éboueur, puis j'ai travaillé pendant 2 ans comme préparateur de commandes chez Metaluplast, une usine de matériel de sport.\n Comme je ne m'épannouissait plus dans mon travail, j'ai quitté Metaluplast et trouvé un emploi comme livreur en juin 2021 pour DPD et Chronopost, je suis devenu chef d'équipe peu après mon recrutement et j'ai géré une équipe de 5 personnes.\n Vers la fin de 2022, je me suis arrangé avec mon employeur et j'ai démissionné, en janvier 2023 mon contrat s'est terminé.\nUne fois mon contrat terminé, j'ai pris un peu de temps pour moi et j'ai commencé à apprendre HTML/CSS pour finalement rentrer en formation d'une durée de 9 mois chez Open Classrooms en juillet 2023.\nActuellement, je suis seulement capable de faire du développement front-end, mais j'ai l'intention d'apprendre le développement back-end dans un futur proche.\n",
        "aboutTools": "Les langages et outils avec lesquels je suis familier :",
        "bookiHeader": "Une entreprise qui souhaite développer un site web pour trouver des hébergements et des activités.",
        "bookiFilters": "Booki est un projet web dont le but est de simplifier la recherche d'hébergements et d'activités dans la ville choisie par l'utilisateur.",
        "bookiPopular": "En utilisant uniquement HTML et CSS, le but ici était d'être aussi proche que possible du modèle figma et de rendre le site responsive pour tablette et mobile.",
        "bookiActivities": "Version Mobile.",
        "ohMyFoodIntro": "Une startup de restauration qui veut développer un site web qui liste les menus des restaurants gastronomiques.",
        "ohMyFoodGoal": "OhMyFood est un projet lié à la restauration, qui en plus des systèmes de réservation classiques, permet aux clients de composer le menu de leurs repas afin qu'ils soient prêts à leur arrivée.",
        "ohMyFoodMobile": "Le but était de créer le site en mobile first, en utilisant HTML et Sass, avec quelques animations comme un écran de chargement, un cœur se remplissant au survol ou au clic et une validation de commande déplaçant le prix d'un article du menu.",
        "ohMyFoodMobile2": "Version mobile",
        "sophieBluelGoal": "En utilisant un backend déjà créé, j'ai importé dynamiquement avec javascript les projets réalisés par le designer d'intérieur, avec des filtres par catégorie. J'ai également créé la page de connexion en utilisant des Jetons Web JSON avec une redirection sur la page d'accueil lorsque l'administrateur est connecté avec succès. Pour finir, j'ai implémenté une modale sur la page d'accueil, permettant à l'admin de POSTER ou SUPPRIMER un travail.",
        "sophieBluelFilters": "Les filtres fonctionnels.",
        "sophieBluelLogin": "Système d'authentification avec des JSON Web Tokens.",
        "sophieBluelAdmin": "La vue admin lorsque l'utilisateur est connecté.",
        "sophieBluelModal1": "La première fenêtre de la modale, permet à l'utilisateur de supprimer un travail en cliquant sur la poubelle et permet également de naviguer vers la fenêtre d'ajout de travail.",
        "sophieBluelModal2": "Sur la deuxième fenêtre, l'utilisateur peut ajouter un travail en téléchargeant une image de moins de 4mo, il doit également remplir le champ du titre et choisir une catégorie, lorsque ces conditions sont remplies, le bouton de validation change de couleur pour devenir vert.",
        "kasaGoal1": "Kasa est un leader dans la location d'appartements, le but ici était de moderniser le site web existant, en utilisant React avec des composants réutilisables comme on peut le voir avec la bannière qui n'a pas la même image sur différentes pages, et aussi des routes utilisant React Router.",
        "kasaGoal2": "Le composant collapse est également réutilisable.",
        "KasaCarousel": "En cliquant sur une image dans la galerie, une redirection est effectuée, affichant les informations correspondant à l'appartement.\n Un carrousel affiche les photos de l'appartement.",
        "kasaInfo": "Toutes les informations affichées ici sont dynamiques, le nom, les tags, ou encore la notation par étoiles. Le composant collapse est réutilisé ici avec 'Description' et 'Équipements'.",
        "kasaInfoAfter": "Le site est également entièrement responsive.",
        "ninaCarducciGallery": "Nina Carducci est un site portfolio d'une photographe professionnelle spécialisée dans la photographie de portrait et d'événements.\n Le but du projet était d'améliorer la performance du site, de réduire les temps de chargement et d'ajouter un référencement local SEO.",
        "ninaCarducciLighthouseBase": "Les résultats de l'audit Lighthouse n'étaient pas très bons, que ce soit en termes de Performance, Accessibilité ou SEO.\n Pour améliorer cela, j'ai optimisé les images, auxquelles j'ai ajouté un lazy loading. J'ai minifié les fichiers javascript existants, ces modifications ont considérablement augmenté la performance du site. J'ai réorganisé la structure HTML et ajouté également la balise meta pour les réseaux sociaux",
        "ninaCarducciLighthouseOpti": "Après ces améliorations, vous pouvez voir sur l'audit Lighthouse, l'énorme écart entre avant et après l'optimisation. Que ce soit sur l'audit mobile ou de bureau.",
        "ninaCarducciKeywords": "Pour le SEO, j'ai également ajouté quelques mots-clés cachés dans différents textes.",
        "ninaCarducciMeta": "Résultat des meta pour le SEO Facebook.",
        "ninaCarducciSnippet": "Résultat du Rich Snippet Google, montrant les informations sur le référencement local SEO.",
        "ninaCarducciWave": "Résultat Wave, montrant aucune erreur concernant l'accessibilité du site.",
        "77eventsGallery": "L'objectif ici était de déboguer le site web. Le carrousel ne fonctionnait pas correctement, une image blanche était affichée, pour changer la diapositive en cours, les boutons radio n'étaient pas utilisables et les images devaient être affichées de la plus ancienne à la plus récente. Dans la liste des événements, certains n'affichent aucune date et d'autres n'affichent pas les bonnes, les filtres ne fonctionnaient pas non plus.",
        "77eventsContactForm": "Concernant le formulaire de contact, aucun message de confirmation n'était affiché.",
        "77eventsFooter": "Pour finir, l'image dans le pied de page était censée afficher le dernier événement, avec la date et la catégorie.",
        "77eventsFooterAfter": "Pour accomplir la tâche, j'ai utilisé le test unitaire pour vérifier chaque composant du site web, en parallèle j'ai écrit un livre de test qui inclut des scénarios, me permettant de vérifier le bon fonctionnement des composants ciblés.",
        "argentbankLogin": "J'ai dû créer le tableau de bord de l'utilisateur en utilisant React et Redux pour gérer l'état.",
        "argentbankAccount": "Avec un modèle qui m'a été donné, j'ai dû recréer le HTML statique en React. J'ai commencé par créer la page d'accueil avec des composants réutilisables pour la section des 'fonctionnalités'. Après cela, j'ai créé le système de connexion, et j'ai également géré la déconnexion.",
        "argentbankForm": "Pour finir, dans la page de profil de l'utilisateur, j'ai ajouté un formulaire qui permet à l'utilisateur de changer uniquement son nom d'utilisateur.",
        "argentbankStore": "Toutes les actions de l'utilisateur sont gérées avec le Redux Store comme vous pouvez le voir ici.",
        "argentbankStoreAfter": "Pour la phase 2 du projet, j'ai dû proposer des endpoints sous forme de swagger, chaque endpoints devait avoir : la méthode HTTP, la route, la description de ce à quoi correspond le endpoints et les différentes réponses avec le code de réponse correspondant.",
        "contactFormName": "Votre Nom",
        "contactFormSubmit": "Envoyer",
        "contactFormSuccess": "Le message a été envoyé avec succès !",
        "altBooki": "Haut de la page Booki avec le logo, les liens vers les sections et le titre.",
        "altBookiHeader": "La barre de recherche et les filtres.",
        "altBookiFilters": "Les hébergements populaires et autres sont présentés dans 2 sections différentes.",
        "altBookiPopular": "Les activités disponibles à Marseille.",
        "altBookiResponsive1": "Version mobile du haut de la page, y compris les filtres.",
        "altBookiResponsive2": "Version mobile de l'hébergement populaire.",
        "altBookiResponsive3": "Version mobile de l'hébergement.",
        "altBookiResponsive4": "Version mobile des activités.",
        "altOhmyfoodHeader": "Haut de la page, le titre, l'emplacement et le bouton pour explorer.",
        "altOhmyfoodIntro": "3 cartes pour expliquer le fonctionnement et 4 cartes de restaurant avec une photo du restaurant, un badge 'nouveau' et un bouton favori en forme de cœur.",
        "altOhmyfoodMenu": "Un menu, avec le nom du restaurant, à côté se trouve le bouton favori et une section 'Entrées' avec 3 plats.",
        "altOhmyfoodLoader": "La version mobile, montrant le chargeur, c'est un bol de ramen avec de la fumée animée au-dessus, et un texte 'chargement' est en dessous.",
        "altOhmyfoodResponsive1": "Version mobile du haut de la page, incluant la partie fonctionnement.",
        "altOhmyfoodResponsive2": "Version mobile de la carte du restaurant.",
        "altOhmyfoodResponsive3": "Version mobile de la page du menu.",
        "altSophieBluelHeader": "Le haut de la page avec le logo, le menu de navigation, une photo de Sophie Bluel et un texte d'introduction.",
        "altSophieBluelProject": "Section projet avec filtres affichant 6 projets.",
        "altSophieBluelProjectFiltered": "Section projet avec les filtres actifs montrant seulement 3 projets de la catégorie sélectionnée.",
        "altSophieBluelLogin": "Formulaire de connexion avec 2 champs et un bouton de connexion.",
        "altSophieBluelAdmin": "Haut de la page montrant la vue administrateur, 'connexion' devient 'déconnexion' et près du titre 'Mes Projets' un bouton 'Modifier' apparaît.",
        "altSophieBluelModal1": "La première modale montre tous les projets sous forme de leurs photos, sur chaque photo il y a une poubelle et un texte 'éditer' en dessous. Il y a aussi un bouton 'Ajouter une photo'.",
        "altSophieBluelModal2": "Sur la seconde modale, il y a 3 champs, 1 sous forme de glisser-déposer pour une photo, 1 texte et 1 sélection de catégorie, sous ces champs il y a un bouton 'valider'.",
        "altKasaHeader": "Page d'accueil avec le logo en haut à gauche, un menu de navigation en haut à droite, une bannière avec une image en arrière-plan et un texte à l'intérieur. ,Sous celle-ci, il y a une présentation des différents appartements sous forme de carte avec la photo de l'appartement et son titre.",
        "altKasaAboutHeader": "Page À propos, avec le même logo et menu de navigation, la bannière sans texte et 4 éléments rétractables.",
        "altKasaCollapse": "Les 4 éléments rétractables avec 2 déployés.",
        "altKasaCarousel": "Page d'informations, avec menu de navigation en haut, un carrousel est en dessous.",
        "altKasaInfo": "En haut à gauche, il y a le nom et l'emplacement de l'appartement, en dessous il y a les tags. En haut à droite, il y a le nom et la photo de la personne qui loue l'appartement, en dessous se trouve l'évaluation. Sous ceux-ci se trouvent 2 éléments rétractables, avec 1 déployé.",
        "altKasaLandingMobile": "Version mobile de la page d'accueil avec le logo et le menu de navigation en haut, sous ceux-ci se trouve la bannière avec le texte et les appartements sont affichés en dessous.",
        "altKasaAboutMobile" : "Version mobile de la page à propos avec le logo et le menu de navigation en haut, la bannière en dessous, et les 4 éléments rétractables. Le premier est déployé.",
        "altKasaInfoMobile" : "Version mobile de la page d'informations sur l'appartement, avec le logo et le menu de navigation en haut, le carrousel est en dessous. Ensuite, de haut en bas, il y a le titre, l'emplacement, les tags, la note avec la personne louant l'appartement à côté et un des éléments rétractables déployé.",
        "altNinaCarducciHeader" : "Logo en haut à gauche avec la navigation en haut à droite, un carrousel est en dessous.",
        "altNinaCarducciGallery" : "Partie portfolio, avec les filtres, et la photo affichée en dessous.",
        "altNinaCarducciLighthousebaseDesktop" : "Résultats de base du phare dans la version de bureau.",
        "altNinaCarducciLighthousebaseMobile" : "Résultats de base du phare dans la version mobile.",
        "altNinaCarducciLighthouseDesktopOpti" : "Résultats optimisés du phare pour bureau.",
        "altNinaCarducciLighthouseMobileOpti" : "Résultats optimisés du phare pour mobile.",
        "altNinaCarducciKeywords" : "Section des services affichant 3 cartes avec du texte à l'intérieur.",
        "altNinaCarducciMeta" : "Résultats Meta pour le SEO Facebook.",
        "altNinaCarducciSnippet" : "Résultats de l'extrait enrichi.",
        "altNinaCarducciWave" : "Résultats Wave.",
        "alt77eventsHeader" : "Haut de la page 77events, avec le logo en haut à gauche, à droite duquel se trouve le menu de navigation. Sous ceux-ci se trouve un carrousel.",
        "alt77eventsGallery" : "Section de réalisation, un menu de filtres est affiché en haut et en dessous les réalisations sous forme de carte.",
        "alt77eventsContact" : "Formulaire de contact avec 4 champs de texte et une liste. Le bouton d'envoi est sous ces champs.",
        "alt77eventsFooter" : "Le pied de page avec la dernière réalisation en bas à gauche et les informations de contact à droite.",
        "altArgentbankHeader" : "Page d'accueil avec le logo en haut à gauche, et un bouton de connexion à droite. Sous celui-ci se trouve une bannière, dans la bannière il y a une carte avec du texte à l'intérieur. Sous la bannière il y a 3 éléments avec du texte associé.",
        "altArgentbankLogin" : "Formulaire de connexion avec 2 champs de texte, une case à cocher se souvenir de moi et un bouton de connexion.",
        "altArgentbankAccount" : "Page de compte avec le logo en haut à gauche, le bouton de déconnexion est à droite avec le nom d'utilisateur avant. Sous cela, il y a un message 'Bienvenue de retour' avec le nom d'utilisateur et il y a aussi un bouton 'Modifier le nom' sous le message. Après cela, il y a 3 cartes de compte.",
        "altArgentbankForm" : "Formulaire de modification de nom avec 3 champs de texte, les champs du prénom et du nom ont un fond gris pour montrer qu'ils ne sont pas modifiables. Le troisième champ est le nom d'utilisateur, il a un fond blanc et est modifiable. Sous ces champs, il y a un bouton enregistrer et annuler.",
        "altArgentbankStore" : "Magasin Redux, avec toutes les actions effectuées à l'intérieur.",
        "altArgentbankSwagger" : "Swagger avec 2 modules, un pour la transaction avec 1 route à l'intérieur, l'autre module est pour la transaction avec 3 routes à l'intérieur."
}