{
    "header-h2": "Front-End Web Developer",
    "nav-about": "About Me",
    "nav-project": "Projects",
    "theme-dark": "Dark",
    "theme-light": "Light",
    "homeAbout": "Born in 2000\nin Caen, France.\nFrom pastry chef to\ndeveloper.\nAfter 7 years of jobs\nthat i don't like\nand multiple tought.\nI decided to learn\nweb development.\nFrom this point,\ni signed up to a\nFront-End developer\nformation on\nOpen Classrooms\nwich last 9 months.",
    "aboutText": "Hi, i'm Erwan, a Web Developer.\n Since childhood, i spend most of my time in front of a screen, i also like to learn, create and design.\n I've worked as an apprentice pastry chef from 2016 to 2018 at the Boulangerie Cherie in Potigny and earned a diploma in this field but i immediately stopped since i weren't passionate enough  to keep working in this area.\n After that, in 2019 i worked for something like 2 months as a garbage collector,then i worked for 2 years as a order picker at Metaluplast, a factory creating sports equipment.\n As i no longer liked this job, i stopped working at Metaluplast and found a job as a delivery guy in june 2021 for DPD and Chronopost, i became a manager shortly after being recruited and I managed a team of 5 people.\n Near the end of 2022 i made arrangements with my employer to quit and in january 2023 my contract came to a end.\n Currently i'm only able to do front-end development, but i intend to learn back-end development in a near future.\n",
    "aboutTools": "The Languages and Tools i'm familliar with :",
    "bookiHeader": "A company who wants to develop a website for finding accomodations and activities.",
    "bookiFilters": "Booki is a web project whose aim is to simplify the search for accommodation and activities in the city chosen by the user.",
    "bookiPopular": "Using only HTML and CSS, the goal here was to be as close as possible to the figma model and to make the site responsive for tablet and mobile.",
    "bookiActivities": "Mobile Version.",
    "ohMyFoodIntro": "A restoration startup who want to develop a website wich list gastronomic restaurant menu.",
    "ohMyFoodGoal": "OhMyFood is a project linked to catering, which in addition to classic reservation systems, allows customers to compose the menu of their meals so that they are ready upon their arrival.",
    "ohMyFoodMobile": "The goal was to create the site in mobile first, using HTML and Sass, with some animation like a loading screen, heart filling with hover or click and a checkout validation moving the price of a menu item.",
    "ohMyFoodMobile2": "Mobile version",
    "sophieBluelGoal": "Using an already created backend, I imported dynamically with javascript the project realized by the interior designer, with filters by category. I also created the login page using Json Web Tokens with a redirection on the landing page when the administrator is logged in succesfully. To finish, i implemented a modal on the landing page, allowing the admin to POST or DELETE a work.",
    "sophieBluelFilters": "The functionnal filters.",
    "sophieBluelLogin": "Authentification system with JSON Web Tokens.",
    "sophieBluelAdmin": "The admin view when the user is logged in.",
    "sophieBluelModal1": "The first window of the modal, allow the user to delete a work while clicking on the trashcan and also allow to navigate to the add work window.",
    "sophieBluelModal2": "On the second window, the user can add a work by uploading a picture wich is less than 4mo, he also need to fill the title field and choose a category, when those conditions are filled, the validate button change color to go green.",
    "kasaGoal1": "Kasa is a leader in apartment rental, the goal here was to modernize the existing website, using React with reusable components as you can see with the banner who don't have the same picture on different page, and also routes using React Router.",
    "kasaGoal2": "The collapse components is also reusable.",
    "KasaCarousel": "When clicking on a image in the gallery, a redirection is done, displaying the informations corresponding the apartment.\n A carousel display the apartment picture.",
    "kasaInfo": "Every informations displayed here are dynamic, the name, the tags, or also the star rating. The collapse components is reused here with 'Description' and 'Equipments'.",
    "kasaInfoAfter": "The website is also completly responsive.",
    "ninaCarducciGallery": "Nina carducci is a portfolio website of a profesionnal photographer specialized in portrait and event photography.\n The goal of the project was to improve the site performance, reduce loading times and add local SEO.",
    "ninaCarducciLighthouseBase": "The audit Lighthouse result weren't that good, whether it be Performance, Accessibility or the SEO.\n To improve this i optimized the images, to which i added lazyloading. I minified the existing javascript files, these modifications significantly increased the performance of the site. I reorganized the HTML structure and also added the meta tag for the social networks",
    "ninaCarducciLighthouseOpti": "After those improvements, you can see on the Lighthouse audit, the huge gap between before and after the optimization. Whether it be on mobile or desktop Audit.",
    "ninaCarducciKeywords": "For the Seo, i also added some keywords hidden in different text.",
    "ninaCarducciMeta": "Meta result for Facebook SEO.",
    "ninaCarducciSnippet": "Google Rich Snippet result, showing the information about the local SEO.",
    "ninaCarducciWave": "Wave result, showing no errors about the accessibility of the site.",
    "77eventsGallery": "The goal here was to debug the website, The carousel wasn't working correctly, a white picture was displayed, to change the current slide,the radio button were not usable and the picture were supposed to be displayed from oldest to most recent. In the list of events, some do not display any dates and others do not display the correct ones, the filters weren't working either. ",
    "77eventsContactForm": "Concerning the contact form, no confirmation message were displayed.",
    "77eventsFooter": "To finish, the picture in the footer was supposed to display the last event, with the date and the category.",
    "77eventsFooterAfter": "To complete the task, i used the unitary test to check each components of the website, in parallel i wrote a test book wich include scenario, allowing me to check the proper functioning of the targetted components.",
    "argentbankLogin": "I had to create the user dashboard while using React and Redux to manage the state.",
    "argentbankAccount": "With a model given to me, i had to recreate the static HTML in react. I first started by creating the landing page with reusable components for the “features” section.",
    "argentbankForm": "After that I created the login system, i also managed the logout. To finish, in the user profile page, i added a form who allow the user to change only his username.",
    "argentbankStore": "All of these user actions were managed with the Redux Store as you can see here.",
    "argentbankStoreAfter": "For phase 2 of the project, I had to propose endpoints in the form of a swagger, each endpoint had to have: the HTTP method, the route, the description of what the endpoint corresponds to and the different responses with the corresponding response code",
    "contactFormName": "Your Name",
    "contactFormSubmit": "Submit",
    "contactFormSuccess": "Message has been send with success!",
    "altBooki": "Top of the booki page with the logo, the links to the sections and the title.",
    "altBookiHeader": "The searchbar and filters",
    "altBookiFilters": "The popular and other accomodations are showed in 2 differents section",
    "altBookiPopular": "The activities available in Marseille",
    "altBookiResponsive1": "Mobile version of the top of the page, and also the filters",
    "altBookiResponsive2": "Mobile version of the popular accomadation ",
    "altBookiResponsive3": "Mobile version of the accomodation",
    "altBookiResponsive4": "Mobile version of the activities",
    "altOhmyfoodHeader": "Top of the page, the title, location and the button to explore.",
    "altOhmyfoodIntro": "3 card to explain the functioning and 4 restaurant card with a picture of the restaurant, a 'new' badge and a favorite button in a shape of a heart.",
    "altOhmyfoodMenu": "A menu, with the name of the restaurant, on the side there is the favorite button and a 'Entrées' section with 3 dishes.",
    "altOhmyfoodLoader": "The mobile version, showing the loader, it's a ramen bowl with animated smoke on the top, and a 'loading' text is under it.",
    "altOhmyfoodResponsive1": "Mobile version of the top of the page, including the functioning part.",
    "altOhmyfoodResponsive2": "Mobile version of the restaurant card.",
    "altOhmyfoodResponsive3": "Mobile version of the menu page.",
    "altSophieBluelHeader": "The top of the page with the logo, the navigation menu, a picture of Sophie Bluel and a introduction text.",
    "altSophieBluelProject": "Project section with filters showing 6 project.",
    "altSophieBluelProjectFiltered": "Project section with the active filters showing only 3 project of the selected category.",
    "altSophieBluelLogin": "Login Form with 2 fields and a connexion button.",
    "altSophieBluelAdmin": "Top of the page showing the admin view,'login' became 'logout' and near the title 'Mes Projets' a 'Modifier' button appear.",
    "altSophieBluelModal1": "The first modal show all the project in the form of their picture, on each picture there is a trashcan and a 'éditer' text under. There is also a 'Ajouter une photo' button.",
    "altSophieBluelModal2": "On the second modal, there is 3 fields, 1 in the form of a drag and drop for a picture, 1 text and 1 category select, under those fields there is a 'valider' button.",
    "altKasaHeader": "Landing page with the logo on the top left, a navigation menu on top right, a banner with a background picture and a text inside. Under that there is a display of the different apartment in form of a card with the picture of the apartment and his title.",
    "altKasaAboutHeader": "About page, with the same logo and navigation menu, the banner without text and 4 collapse items.",
    "altKasaCollapse": "The 4 collapse item with 2 deployed.",
    "altKasaCarousel": "Info page, with navigation menu on top, a carousel is under it.",
    "altKasaInfo": "On top left there is the name and location of the apartment, under it the is the tags. On top right there is the name and picture of the person who rents the apartment, under is the rating. Under those are 2 collapse items, with 1 deployed.",
    "altKasaLandingMobile": "Mobile version of the landing page with the logo and navigation menu at the top, under it there is the banner with the text and the apartment are displayed under.",
    "altKasaAboutMobile": "Mobile version of the about page with the logo and navigation menu at the top, the banenr under, and the 4 collapse items. The first one is deployed.",
    "altKasaInfoMobile": "Mobile version of the info page about the apartment, the logo and navigation menu at the top, the carousel is under it. After that from top to bottom there is, the title, the location, the tags, the rating with the person renting the apartment next to it and one of the collapse item deployed.",
    "altNinaCarducciHeader": "Logo on top left with the navigation on top right, a carousel is under that.",
    "altNinaCarducciGallery": "Portfolio part, with the filters, and the displayed picture under it.",
    "altNinaCarducciLighthousebaseDesktop": "Base lighthouse results in the desktop version.",
    "altNinaCarducciLighthousebaseMobile": "Base lighthouse results in the mobile version.",
    "altNinaCarducciLighthouseDesktopOpti": "Optimized lighthouse desktop results.",
    "altNinaCarducciLighthouseMobileOpti": "Optimized lighthouse mobile results.",
    "altNinaCarducciKeywords": "Services section displaying 3 cards with text inside.",
    "altNinaCarducciMeta": "Meta results for the Facebook SEO.",
    "altNinaCarducciSnippet": "Rich snippet results.",
    "altNinaCarducciWave": "Wave results.",
    "alt77eventsHeader": "The top of the 77events page, with the logo on the top left, on the  right of it there is the navigation menu. Under those is a carousel.",
    "alt77eventsGallery": "Realization section, a filters menu is displayed on top and under it are the realization in form of a card.",
    "alt77eventsContact": "Contact form with 4 text fields and one list. The submit button is under those fields.",
    "alt77eventsFooter": "The footer with the last realization on bottom left and the contact info on the right.",
    "altArgentbankHeader": "Landing page with the logo on top left, and a sign in button on right. Under it is a banner, inside the banner there is a card with text inside. Under the banner there is 3 items with associated text.",
    "altArgentbankLogin": "Login form with 2 text fields, a remember me checkbox and a sign in button.",
    "altArgentbankAccount": "Account page with the logo on top left, the sign out button is on the right with the username before it. Under that there is a 'Welcome back' message with the username and there is also a button 'Edit name' under the message. After that there is 3 account card.",
    "altArgentbankForm": "Edit name form with 3 text field, the first name and last name field have a gray background to show that they are not editable. The third field is the username, he have a white background and is editable. Under those fields there is a save and cancel button.",
    "altArgentbankStore": "Redux store, with all actions done inside it.",
    "altArgentbankSwagger": "Swagger with 2 modules, one for the transaction with 1 route inside, the other module is for the transaction with 3 route inside."
}